RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_IOMUXC_GPR.h
/*! @name GPR0 - GPR0 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR0_SAI1_MCLK1_SEL_MASK      (0x7U)
#define IOMUXC_GPR_GPR0_SAI1_MCLK1_SEL_SHIFT     (0U)
/*! SAI1_MCLK1_SEL - SAI1 MCLK1 source select */
#define IOMUXC_GPR_GPR0_SAI1_MCLK1_SEL(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR0_SAI1_MCLK1_SEL_SHIFT)) & IOMUXC_GPR_GPR0_SAI1_MCLK1_SEL_MASK)

#define IOMUXC_GPR_GPR0_SAI1_MCLK2_SEL_MASK      (0x38U)
#define IOMUXC_GPR_GPR0_SAI1_MCLK2_SEL_SHIFT     (3U)
/*! SAI1_MCLK2_SEL - SAI1 MCLK2 source select */
#define IOMUXC_GPR_GPR0_SAI1_MCLK2_SEL(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR0_SAI1_MCLK2_SEL_SHIFT)) & IOMUXC_GPR_GPR0_SAI1_MCLK2_SEL_MASK)

#define IOMUXC_GPR_GPR0_SAI1_MCLK3_SEL_MASK      (0xC0U)
#define IOMUXC_GPR_GPR0_SAI1_MCLK3_SEL_SHIFT     (6U)
/*! SAI1_MCLK3_SEL - SAI1 MCLK3 source select */
#define IOMUXC_GPR_GPR0_SAI1_MCLK3_SEL(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR0_SAI1_MCLK3_SEL_SHIFT)) & IOMUXC_GPR_GPR0_SAI1_MCLK3_SEL_MASK)

#define IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_MASK       (0x100U)
#define IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_SHIFT      (8U)
/*! SAI1_MCLK_DIR - SAI1_MCLK signal direction control */
#define IOMUXC_GPR_GPR0_SAI1_MCLK_DIR(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_SHIFT)) & IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_MASK)

#define IOMUXC_GPR_GPR0_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR0_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR0_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR0_DWP_SHIFT)) & IOMUXC_GPR_GPR0_DWP_MASK)

#define IOMUXC_GPR_GPR0_DWP_LOCK_MASK            (0xC0000000U)
#define IOMUXC_GPR_GPR0_DWP_LOCK_SHIFT           (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR0_DWP_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR0_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR0_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR1 - GPR1 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL_MASK      (0x3U)
#define IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL_SHIFT     (0U)
/*! SAI2_MCLK3_SEL - SAI2 MCLK3 source select */
#define IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)) & IOMUXC_GPR_GPR1_SAI2_MCLK3_SEL_MASK)

#define IOMUXC_GPR_GPR1_SAI2_MCLK_DIR_MASK       (0x100U)
#define IOMUXC_GPR_GPR1_SAI2_MCLK_DIR_SHIFT      (8U)
/*! SAI2_MCLK_DIR - SAI2_MCLK signal direction control */
#define IOMUXC_GPR_GPR1_SAI2_MCLK_DIR(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR1_SAI2_MCLK_DIR_SHIFT)) & IOMUXC_GPR_GPR1_SAI2_MCLK_DIR_MASK)

#define IOMUXC_GPR_GPR1_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR1_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR1_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR1_DWP_SHIFT)) & IOMUXC_GPR_GPR1_DWP_MASK)

#define IOMUXC_GPR_GPR1_DWP_LOCK_MASK            (0xC0000000U)
#define IOMUXC_GPR_GPR1_DWP_LOCK_SHIFT           (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR1_DWP_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR1_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR1_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR2 - GPR2 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR2_SAI3_MCLK3_SEL_MASK      (0x3U)
#define IOMUXC_GPR_GPR2_SAI3_MCLK3_SEL_SHIFT     (0U)
/*! SAI3_MCLK3_SEL - SAI3 MCLK3 source select */
#define IOMUXC_GPR_GPR2_SAI3_MCLK3_SEL(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR2_SAI3_MCLK3_SEL_SHIFT)) & IOMUXC_GPR_GPR2_SAI3_MCLK3_SEL_MASK)

#define IOMUXC_GPR_GPR2_SAI3_MCLK_DIR_MASK       (0x100U)
#define IOMUXC_GPR_GPR2_SAI3_MCLK_DIR_SHIFT      (8U)
/*! SAI3_MCLK_DIR - SAI3_MCLK signal direction control */
#define IOMUXC_GPR_GPR2_SAI3_MCLK_DIR(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR2_SAI3_MCLK_DIR_SHIFT)) & IOMUXC_GPR_GPR2_SAI3_MCLK_DIR_MASK)

#define IOMUXC_GPR_GPR2_SAI4_MCLK_DIR_MASK       (0x200U)
#define IOMUXC_GPR_GPR2_SAI4_MCLK_DIR_SHIFT      (9U)
/*! SAI4_MCLK_DIR - SAI4_MCLK signal direction control */
#define IOMUXC_GPR_GPR2_SAI4_MCLK_DIR(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR2_SAI4_MCLK_DIR_SHIFT)) & IOMUXC_GPR_GPR2_SAI4_MCLK_DIR_MASK)

#define IOMUXC_GPR_GPR2_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR2_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR2_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR2_DWP_SHIFT)) & IOMUXC_GPR_GPR2_DWP_MASK)

#define IOMUXC_GPR_GPR2_DWP_LOCK_MASK            (0xC0000000U)
#define IOMUXC_GPR_GPR2_DWP_LOCK_SHIFT           (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR2_DWP_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR2_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR2_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR3 - GPR3 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR3_MQS_CLK_DIV_MASK         (0xFFU)
#define IOMUXC_GPR_GPR3_MQS_CLK_DIV_SHIFT        (0U)
/*! MQS_CLK_DIV - Divider ratio control for mclk from hmclk. */
#define IOMUXC_GPR_GPR3_MQS_CLK_DIV(x)           (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR3_MQS_CLK_DIV_SHIFT)) & IOMUXC_GPR_GPR3_MQS_CLK_DIV_MASK)

#define IOMUXC_GPR_GPR3_MQS_SW_RST_MASK          (0x100U)
#define IOMUXC_GPR_GPR3_MQS_SW_RST_SHIFT         (8U)
/*! MQS_SW_RST - MQS software reset */
#define IOMUXC_GPR_GPR3_MQS_SW_RST(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR3_MQS_SW_RST_SHIFT)) & IOMUXC_GPR_GPR3_MQS_SW_RST_MASK)

