RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_IOMUXC_GPR.h
#define IOMUXC_GPR_GPR3_MQS_EN_MASK              (0x200U)
#define IOMUXC_GPR_GPR3_MQS_EN_SHIFT             (9U)
/*! MQS_EN - MQS enable */
#define IOMUXC_GPR_GPR3_MQS_EN(x)                (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR3_MQS_EN_SHIFT)) & IOMUXC_GPR_GPR3_MQS_EN_MASK)

#define IOMUXC_GPR_GPR3_MQS_OVERSAMPLE_MASK      (0x400U)
#define IOMUXC_GPR_GPR3_MQS_OVERSAMPLE_SHIFT     (10U)
/*! MQS_OVERSAMPLE - Medium Quality Sound (MQS) Oversample */
#define IOMUXC_GPR_GPR3_MQS_OVERSAMPLE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR3_MQS_OVERSAMPLE_SHIFT)) & IOMUXC_GPR_GPR3_MQS_OVERSAMPLE_MASK)

#define IOMUXC_GPR_GPR3_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR3_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR3_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR3_DWP_SHIFT)) & IOMUXC_GPR_GPR3_DWP_MASK)

#define IOMUXC_GPR_GPR3_DWP_LOCK_MASK            (0xC0000000U)
#define IOMUXC_GPR_GPR3_DWP_LOCK_SHIFT           (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR3_DWP_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR3_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR3_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR4 - GPR4 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR4_ENET_TX_CLK_SEL_MASK     (0x1U)
#define IOMUXC_GPR_GPR4_ENET_TX_CLK_SEL_SHIFT    (0U)
/*! ENET_TX_CLK_SEL - ENET TX_CLK select */
#define IOMUXC_GPR_GPR4_ENET_TX_CLK_SEL(x)       (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR4_ENET_TX_CLK_SEL_SHIFT)) & IOMUXC_GPR_GPR4_ENET_TX_CLK_SEL_MASK)

#define IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_MASK    (0x2U)
#define IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_SHIFT   (1U)
/*! ENET_REF_CLK_DIR - ENET_REF_CLK direction control */
#define IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_SHIFT)) & IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_MASK)

#define IOMUXC_GPR_GPR4_ENET_TIME_SEL_MASK       (0x4U)
#define IOMUXC_GPR_GPR4_ENET_TIME_SEL_SHIFT      (2U)
/*! ENET_TIME_SEL - ENET master timer source select */
#define IOMUXC_GPR_GPR4_ENET_TIME_SEL(x)         (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR4_ENET_TIME_SEL_SHIFT)) & IOMUXC_GPR_GPR4_ENET_TIME_SEL_MASK)

#define IOMUXC_GPR_GPR4_ENET_EVENT0IN_SEL_MASK   (0x8U)
#define IOMUXC_GPR_GPR4_ENET_EVENT0IN_SEL_SHIFT  (3U)
/*! ENET_EVENT0IN_SEL - ENET ENET_1588_EVENT0_IN source select */
#define IOMUXC_GPR_GPR4_ENET_EVENT0IN_SEL(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR4_ENET_EVENT0IN_SEL_SHIFT)) & IOMUXC_GPR_GPR4_ENET_EVENT0IN_SEL_MASK)

#define IOMUXC_GPR_GPR4_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR4_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR4_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR4_DWP_SHIFT)) & IOMUXC_GPR_GPR4_DWP_MASK)

#define IOMUXC_GPR_GPR4_DWP_LOCK_MASK            (0xC0000000U)
#define IOMUXC_GPR_GPR4_DWP_LOCK_SHIFT           (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR4_DWP_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR4_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR4_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR5 - GPR5 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR5_ENET1G_TX_CLK_SEL_MASK   (0x1U)
#define IOMUXC_GPR_GPR5_ENET1G_TX_CLK_SEL_SHIFT  (0U)
/*! ENET1G_TX_CLK_SEL - ENET1G TX_CLK select */
#define IOMUXC_GPR_GPR5_ENET1G_TX_CLK_SEL(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_ENET1G_TX_CLK_SEL_SHIFT)) & IOMUXC_GPR_GPR5_ENET1G_TX_CLK_SEL_MASK)

#define IOMUXC_GPR_GPR5_ENET1G_REF_CLK_DIR_MASK  (0x2U)
#define IOMUXC_GPR_GPR5_ENET1G_REF_CLK_DIR_SHIFT (1U)
/*! ENET1G_REF_CLK_DIR - ENET1G_REF_CLK direction control */
#define IOMUXC_GPR_GPR5_ENET1G_REF_CLK_DIR(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_ENET1G_REF_CLK_DIR_SHIFT)) & IOMUXC_GPR_GPR5_ENET1G_REF_CLK_DIR_MASK)

#define IOMUXC_GPR_GPR5_ENET1G_RGMII_EN_MASK     (0x4U)
#define IOMUXC_GPR_GPR5_ENET1G_RGMII_EN_SHIFT    (2U)
/*! ENET1G_RGMII_EN - ENET1G RGMII TX clock output enable */
#define IOMUXC_GPR_GPR5_ENET1G_RGMII_EN(x)       (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_ENET1G_RGMII_EN_SHIFT)) & IOMUXC_GPR_GPR5_ENET1G_RGMII_EN_MASK)

#define IOMUXC_GPR_GPR5_ENET1G_TIME_SEL_MASK     (0x8U)
#define IOMUXC_GPR_GPR5_ENET1G_TIME_SEL_SHIFT    (3U)
/*! ENET1G_TIME_SEL - ENET1G master timer source select */
#define IOMUXC_GPR_GPR5_ENET1G_TIME_SEL(x)       (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_ENET1G_TIME_SEL_SHIFT)) & IOMUXC_GPR_GPR5_ENET1G_TIME_SEL_MASK)

#define IOMUXC_GPR_GPR5_ENET1G_EVENT0IN_SEL_MASK (0x10U)
#define IOMUXC_GPR_GPR5_ENET1G_EVENT0IN_SEL_SHIFT (4U)
/*! ENET1G_EVENT0IN_SEL - ENET1G ENET_1588_EVENT0_IN source select */
#define IOMUXC_GPR_GPR5_ENET1G_EVENT0IN_SEL(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_ENET1G_EVENT0IN_SEL_SHIFT)) & IOMUXC_GPR_GPR5_ENET1G_EVENT0IN_SEL_MASK)

#define IOMUXC_GPR_GPR5_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR5_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR5_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_DWP_SHIFT)) & IOMUXC_GPR_GPR5_DWP_MASK)

#define IOMUXC_GPR_GPR5_DWP_LOCK_MASK            (0xC0000000U)
#define IOMUXC_GPR_GPR5_DWP_LOCK_SHIFT           (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR5_DWP_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR5_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR5_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR6 - GPR6 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR_MASK (0x1U)
#define IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR_SHIFT (0U)
/*! ENET_QOS_REF_CLK_DIR - ENET_QOS_REF_CLK direction control */
#define IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR(x)  (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR_SHIFT)) & IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR_MASK)

#define IOMUXC_GPR_GPR6_ENET_QOS_RGMII_EN_MASK   (0x2U)
#define IOMUXC_GPR_GPR6_ENET_QOS_RGMII_EN_SHIFT  (1U)
/*! ENET_QOS_RGMII_EN - ENET_QOS RGMII TX clock output enable */
#define IOMUXC_GPR_GPR6_ENET_QOS_RGMII_EN(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_ENET_QOS_RGMII_EN_SHIFT)) & IOMUXC_GPR_GPR6_ENET_QOS_RGMII_EN_MASK)

#define IOMUXC_GPR_GPR6_ENET_QOS_TIME_SEL_MASK   (0x4U)
#define IOMUXC_GPR_GPR6_ENET_QOS_TIME_SEL_SHIFT  (2U)
/*! ENET_QOS_TIME_SEL - ENET_QOS master timer source select */
#define IOMUXC_GPR_GPR6_ENET_QOS_TIME_SEL(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_ENET_QOS_TIME_SEL_SHIFT)) & IOMUXC_GPR_GPR6_ENET_QOS_TIME_SEL_MASK)

#define IOMUXC_GPR_GPR6_ENET_QOS_INTF_SEL_MASK   (0x38U)
#define IOMUXC_GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT  (3U)
/*! ENET_QOS_INTF_SEL - ENET_QOS PHY Interface Select */
#define IOMUXC_GPR_GPR6_ENET_QOS_INTF_SEL(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT)) & IOMUXC_GPR_GPR6_ENET_QOS_INTF_SEL_MASK)

#define IOMUXC_GPR_GPR6_ENET_QOS_CLKGEN_EN_MASK  (0x40U)
#define IOMUXC_GPR_GPR6_ENET_QOS_CLKGEN_EN_SHIFT (6U)
/*! ENET_QOS_CLKGEN_EN - ENET_QOS clock generator enable */
#define IOMUXC_GPR_GPR6_ENET_QOS_CLKGEN_EN(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_ENET_QOS_CLKGEN_EN_SHIFT)) & IOMUXC_GPR_GPR6_ENET_QOS_CLKGEN_EN_MASK)

#define IOMUXC_GPR_GPR6_ENET_QOS_EVENT0IN_SEL_MASK (0x80U)
#define IOMUXC_GPR_GPR6_ENET_QOS_EVENT0IN_SEL_SHIFT (7U)
/*! ENET_QOS_EVENT0IN_SEL - ENET_QOS ENET_1588_EVENT0_IN source select */
#define IOMUXC_GPR_GPR6_ENET_QOS_EVENT0IN_SEL(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_ENET_QOS_EVENT0IN_SEL_SHIFT)) & IOMUXC_GPR_GPR6_ENET_QOS_EVENT0IN_SEL_MASK)

#define IOMUXC_GPR_GPR6_DWP_MASK                 (0x30000000U)
#define IOMUXC_GPR_GPR6_DWP_SHIFT                (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR6_DWP(x)                   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR6_DWP_SHIFT)) & IOMUXC_GPR_GPR6_DWP_MASK)

