RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_IOMUXC_GPR.h
#define IOMUXC_GPR_GPR70_ADC2_STOP_REQ_MASK      (0x10U)
#define IOMUXC_GPR_GPR70_ADC2_STOP_REQ_SHIFT     (4U)
/*! ADC2_STOP_REQ - ADC2 stop request */
#define IOMUXC_GPR_GPR70_ADC2_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_ADC2_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_ADC2_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_ADC2_IPG_STOP_MODE_MASK (0x20U)
#define IOMUXC_GPR_GPR70_ADC2_IPG_STOP_MODE_SHIFT (5U)
/*! ADC2_IPG_STOP_MODE - ADC2 stop mode selection, cannot change when ADC2_STOP_REQ is asserted.
 *  0b0..This module is functional in Stop Mode
 *  0b1..This module is not functional in Stop Mode and the corresponding x_STOP_REQ field is set to '1'.
 */
#define IOMUXC_GPR_GPR70_ADC2_IPG_STOP_MODE(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_ADC2_IPG_STOP_MODE_SHIFT)) & IOMUXC_GPR_GPR70_ADC2_IPG_STOP_MODE_MASK)

#define IOMUXC_GPR_GPR70_CAAM_IPG_DOZE_MASK      (0x40U)
#define IOMUXC_GPR_GPR70_CAAM_IPG_DOZE_SHIFT     (6U)
/*! CAAM_IPG_DOZE - CAN3 doze mode */
#define IOMUXC_GPR_GPR70_CAAM_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAAM_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_CAAM_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_CAAM_STOP_REQ_MASK      (0x80U)
#define IOMUXC_GPR_GPR70_CAAM_STOP_REQ_SHIFT     (7U)
/*! CAAM_STOP_REQ - CAAM stop request */
#define IOMUXC_GPR_GPR70_CAAM_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAAM_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_CAAM_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_CAN1_IPG_DOZE_MASK      (0x100U)
#define IOMUXC_GPR_GPR70_CAN1_IPG_DOZE_SHIFT     (8U)
/*! CAN1_IPG_DOZE - CAN1 doze mode */
#define IOMUXC_GPR_GPR70_CAN1_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAN1_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_CAN1_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_CAN1_STOP_REQ_MASK      (0x200U)
#define IOMUXC_GPR_GPR70_CAN1_STOP_REQ_SHIFT     (9U)
/*! CAN1_STOP_REQ - CAN1 stop request */
#define IOMUXC_GPR_GPR70_CAN1_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAN1_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_CAN1_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_CAN2_IPG_DOZE_MASK      (0x400U)
#define IOMUXC_GPR_GPR70_CAN2_IPG_DOZE_SHIFT     (10U)
/*! CAN2_IPG_DOZE - CAN2 doze mode */
#define IOMUXC_GPR_GPR70_CAN2_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAN2_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_CAN2_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_CAN2_STOP_REQ_MASK      (0x800U)
#define IOMUXC_GPR_GPR70_CAN2_STOP_REQ_SHIFT     (11U)
/*! CAN2_STOP_REQ - CAN2 stop request */
#define IOMUXC_GPR_GPR70_CAN2_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAN2_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_CAN2_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_CAN3_IPG_DOZE_MASK      (0x1000U)
#define IOMUXC_GPR_GPR70_CAN3_IPG_DOZE_SHIFT     (12U)
/*! CAN3_IPG_DOZE - CAN3 doze mode */
#define IOMUXC_GPR_GPR70_CAN3_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAN3_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_CAN3_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_CAN3_STOP_REQ_MASK      (0x2000U)
#define IOMUXC_GPR_GPR70_CAN3_STOP_REQ_SHIFT     (13U)
/*! CAN3_STOP_REQ - CAN3 stop request */
#define IOMUXC_GPR_GPR70_CAN3_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_CAN3_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_CAN3_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_EDMA_STOP_REQ_MASK      (0x8000U)
#define IOMUXC_GPR_GPR70_EDMA_STOP_REQ_SHIFT     (15U)
/*! EDMA_STOP_REQ - EDMA stop request */
#define IOMUXC_GPR_GPR70_EDMA_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_EDMA_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_EDMA_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_EDMA_LPSR_STOP_REQ_MASK (0x10000U)
#define IOMUXC_GPR_GPR70_EDMA_LPSR_STOP_REQ_SHIFT (16U)
/*! EDMA_LPSR_STOP_REQ - EDMA_LPSR stop request */
#define IOMUXC_GPR_GPR70_EDMA_LPSR_STOP_REQ(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_EDMA_LPSR_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_EDMA_LPSR_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_ENET_IPG_DOZE_MASK      (0x20000U)
#define IOMUXC_GPR_GPR70_ENET_IPG_DOZE_SHIFT     (17U)
/*! ENET_IPG_DOZE - ENET doze mode */
#define IOMUXC_GPR_GPR70_ENET_IPG_DOZE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_ENET_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_ENET_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_ENET_STOP_REQ_MASK      (0x40000U)
#define IOMUXC_GPR_GPR70_ENET_STOP_REQ_SHIFT     (18U)
/*! ENET_STOP_REQ - ENET stop request */
#define IOMUXC_GPR_GPR70_ENET_STOP_REQ(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_ENET_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_ENET_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_ENET1G_IPG_DOZE_MASK    (0x80000U)
#define IOMUXC_GPR_GPR70_ENET1G_IPG_DOZE_SHIFT   (19U)
/*! ENET1G_IPG_DOZE - ENET1G doze mode */
#define IOMUXC_GPR_GPR70_ENET1G_IPG_DOZE(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_ENET1G_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_ENET1G_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_ENET1G_STOP_REQ_MASK    (0x100000U)
#define IOMUXC_GPR_GPR70_ENET1G_STOP_REQ_SHIFT   (20U)
/*! ENET1G_STOP_REQ - ENET1G stop request */
#define IOMUXC_GPR_GPR70_ENET1G_STOP_REQ(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_ENET1G_STOP_REQ_SHIFT)) & IOMUXC_GPR_GPR70_ENET1G_STOP_REQ_MASK)

#define IOMUXC_GPR_GPR70_FLEXIO1_IPG_DOZE_MASK   (0x200000U)
#define IOMUXC_GPR_GPR70_FLEXIO1_IPG_DOZE_SHIFT  (21U)
/*! FLEXIO1_IPG_DOZE - FLEXIO2 doze mode */
#define IOMUXC_GPR_GPR70_FLEXIO1_IPG_DOZE(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_FLEXIO1_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_FLEXIO1_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_FLEXIO2_IPG_DOZE_MASK   (0x400000U)
#define IOMUXC_GPR_GPR70_FLEXIO2_IPG_DOZE_SHIFT  (22U)
/*! FLEXIO2_IPG_DOZE - FLEXIO2 doze mode */
#define IOMUXC_GPR_GPR70_FLEXIO2_IPG_DOZE(x)     (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_FLEXIO2_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_FLEXIO2_IPG_DOZE_MASK)

#define IOMUXC_GPR_GPR70_FLEXSPI1_IPG_DOZE_MASK  (0x800000U)
#define IOMUXC_GPR_GPR70_FLEXSPI1_IPG_DOZE_SHIFT (23U)
/*! FLEXSPI1_IPG_DOZE - FLEXSPI1 doze mode */
#define IOMUXC_GPR_GPR70_FLEXSPI1_IPG_DOZE(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR70_FLEXSPI1_IPG_DOZE_SHIFT)) & IOMUXC_GPR_GPR70_FLEXSPI1_IPG_DOZE_MASK)

