RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_IOMUXC_GPR.h
#define IOMUXC_GPR_GPR74_DWP_MASK                (0x30000000U)
#define IOMUXC_GPR_GPR74_DWP_SHIFT               (28U)
/*! DWP - Domain write protection
 *  0b00..Both cores are allowed
 *  0b01..CM7 is forbidden
 *  0b10..CM4 is forbidden
 *  0b11..Both cores are forbidden
 */
#define IOMUXC_GPR_GPR74_DWP(x)                  (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_DWP_SHIFT)) & IOMUXC_GPR_GPR74_DWP_MASK)

#define IOMUXC_GPR_GPR74_DWP_LOCK_MASK           (0xC0000000U)
#define IOMUXC_GPR_GPR74_DWP_LOCK_SHIFT          (30U)
/*! DWP_LOCK - Domain write protection lock
 *  0b00..Neither of DWP bits is locked
 *  0b01..The lower DWP bit is locked
 *  0b10..The higher DWP bit is locked
 *  0b11..Both DWP bits are locked
 */
#define IOMUXC_GPR_GPR74_DWP_LOCK(x)             (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR74_DWP_LOCK_SHIFT)) & IOMUXC_GPR_GPR74_DWP_LOCK_MASK)
/*! @} */

/*! @name GPR75 - GPR75 General Purpose Register */
/*! @{ */

#define IOMUXC_GPR_GPR75_ADC1_STOP_ACK_MASK      (0x1U)
#define IOMUXC_GPR_GPR75_ADC1_STOP_ACK_SHIFT     (0U)
/*! ADC1_STOP_ACK - ADC1 stop acknowledge */
#define IOMUXC_GPR_GPR75_ADC1_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_ADC1_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_ADC1_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_ADC2_STOP_ACK_MASK      (0x2U)
#define IOMUXC_GPR_GPR75_ADC2_STOP_ACK_SHIFT     (1U)
/*! ADC2_STOP_ACK - ADC2 stop acknowledge */
#define IOMUXC_GPR_GPR75_ADC2_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_ADC2_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_ADC2_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_CAAM_STOP_ACK_MASK      (0x4U)
#define IOMUXC_GPR_GPR75_CAAM_STOP_ACK_SHIFT     (2U)
/*! CAAM_STOP_ACK - CAAM stop acknowledge */
#define IOMUXC_GPR_GPR75_CAAM_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_CAAM_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_CAAM_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_CAN1_STOP_ACK_MASK      (0x8U)
#define IOMUXC_GPR_GPR75_CAN1_STOP_ACK_SHIFT     (3U)
/*! CAN1_STOP_ACK - CAN1 stop acknowledge */
#define IOMUXC_GPR_GPR75_CAN1_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_CAN1_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_CAN1_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_CAN2_STOP_ACK_MASK      (0x10U)
#define IOMUXC_GPR_GPR75_CAN2_STOP_ACK_SHIFT     (4U)
/*! CAN2_STOP_ACK - CAN2 stop acknowledge */
#define IOMUXC_GPR_GPR75_CAN2_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_CAN2_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_CAN2_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_CAN3_STOP_ACK_MASK      (0x20U)
#define IOMUXC_GPR_GPR75_CAN3_STOP_ACK_SHIFT     (5U)
/*! CAN3_STOP_ACK - CAN3 stop acknowledge */
#define IOMUXC_GPR_GPR75_CAN3_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_CAN3_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_CAN3_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_EDMA_STOP_ACK_MASK      (0x40U)
#define IOMUXC_GPR_GPR75_EDMA_STOP_ACK_SHIFT     (6U)
/*! EDMA_STOP_ACK - EDMA stop acknowledge */
#define IOMUXC_GPR_GPR75_EDMA_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_EDMA_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_EDMA_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_EDMA_LPSR_STOP_ACK_MASK (0x80U)
#define IOMUXC_GPR_GPR75_EDMA_LPSR_STOP_ACK_SHIFT (7U)
/*! EDMA_LPSR_STOP_ACK - EDMA_LPSR stop acknowledge */
#define IOMUXC_GPR_GPR75_EDMA_LPSR_STOP_ACK(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_EDMA_LPSR_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_EDMA_LPSR_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_ENET_STOP_ACK_MASK      (0x100U)
#define IOMUXC_GPR_GPR75_ENET_STOP_ACK_SHIFT     (8U)
/*! ENET_STOP_ACK - ENET stop acknowledge */
#define IOMUXC_GPR_GPR75_ENET_STOP_ACK(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_ENET_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_ENET_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_ENET1G_STOP_ACK_MASK    (0x200U)
#define IOMUXC_GPR_GPR75_ENET1G_STOP_ACK_SHIFT   (9U)
/*! ENET1G_STOP_ACK - ENET1G stop acknowledge */
#define IOMUXC_GPR_GPR75_ENET1G_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_ENET1G_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_ENET1G_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_FLEXSPI1_STOP_ACK_MASK  (0x400U)
#define IOMUXC_GPR_GPR75_FLEXSPI1_STOP_ACK_SHIFT (10U)
/*! FLEXSPI1_STOP_ACK - FLEXSPI1 stop acknowledge */
#define IOMUXC_GPR_GPR75_FLEXSPI1_STOP_ACK(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_FLEXSPI1_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_FLEXSPI1_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_FLEXSPI2_STOP_ACK_MASK  (0x800U)
#define IOMUXC_GPR_GPR75_FLEXSPI2_STOP_ACK_SHIFT (11U)
/*! FLEXSPI2_STOP_ACK - FLEXSPI2 stop acknowledge */
#define IOMUXC_GPR_GPR75_FLEXSPI2_STOP_ACK(x)    (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_FLEXSPI2_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_FLEXSPI2_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPI2C1_STOP_ACK_MASK    (0x1000U)
#define IOMUXC_GPR_GPR75_LPI2C1_STOP_ACK_SHIFT   (12U)
/*! LPI2C1_STOP_ACK - LPI2C1 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPI2C1_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPI2C1_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPI2C1_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPI2C2_STOP_ACK_MASK    (0x2000U)
#define IOMUXC_GPR_GPR75_LPI2C2_STOP_ACK_SHIFT   (13U)
/*! LPI2C2_STOP_ACK - LPI2C2 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPI2C2_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPI2C2_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPI2C2_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPI2C3_STOP_ACK_MASK    (0x4000U)
#define IOMUXC_GPR_GPR75_LPI2C3_STOP_ACK_SHIFT   (14U)
/*! LPI2C3_STOP_ACK - LPI2C3 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPI2C3_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPI2C3_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPI2C3_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPI2C4_STOP_ACK_MASK    (0x8000U)
#define IOMUXC_GPR_GPR75_LPI2C4_STOP_ACK_SHIFT   (15U)
/*! LPI2C4_STOP_ACK - LPI2C4 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPI2C4_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPI2C4_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPI2C4_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPI2C5_STOP_ACK_MASK    (0x10000U)
#define IOMUXC_GPR_GPR75_LPI2C5_STOP_ACK_SHIFT   (16U)
/*! LPI2C5_STOP_ACK - LPI2C5 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPI2C5_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPI2C5_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPI2C5_STOP_ACK_MASK)

#define IOMUXC_GPR_GPR75_LPI2C6_STOP_ACK_MASK    (0x20000U)
#define IOMUXC_GPR_GPR75_LPI2C6_STOP_ACK_SHIFT   (17U)
/*! LPI2C6_STOP_ACK - LPI2C6 stop acknowledge */
#define IOMUXC_GPR_GPR75_LPI2C6_STOP_ACK(x)      (((uint32_t)(((uint32_t)(x)) << IOMUXC_GPR_GPR75_LPI2C6_STOP_ACK_SHIFT)) & IOMUXC_GPR_GPR75_LPI2C6_STOP_ACK_MASK)

